app/Controllers/Login.php

    public function index()
    {
        helper(['form']);
        $rules = [
            'email'     => 'required|valid_email',
            'password'  => 'required|min_length[3]'
        ];

        if (!$this->validate($rules)) return $this->fail($this->validator->getErrors());

        $user = $this->user->where('user_email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `users`
WHERE `user_email` = 'admin@admin.com'
 LIMIT 1